0/U
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.4.0 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 object U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 1 -1 0 0 0 0];
internalField uniform (5 0 0);
boundaryField
{
 top
 {
 type symmetryPlane;
 }
 bottom
 {
 type symmetryPlane;
 }
 inlet
 {
//  type freestream;
//  freestreamValue uniform (2 0 0);
type fixedValue;
value uniform (5 0 0);
 }
 outlet
 {
//  type freestream;
//  freestreamValue uniform (2 0 0);
type zeroGradient;
 }
 cylinder
 {
 type fixedValue;
value uniform (0 0 0);
 }
 frontAndBack
 {
 type empty;
 }
}
// ************************************************************************* //