0/p
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.4.0 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
 top
 {
 type symmetryPlane;
 }
 bottom
 {
 type symmetryPlane;
 }
 inlet
 {
 type zeroGradient;
//  freestreamValue uniform 101325;
 }
 outlet
 {
	// type zeroGradient;
 type zeroGradient;
//  freestreamValue uniform 101325;
 }
 frontAndBack
 {
 type empty;
 }
 cylinder
 {
 type zeroGradient;
 }
}
// ************************************************************************* //