0/T
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.4.0 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 0 0 1 0 0 0];
internalField uniform 300;
boundaryField
{
 top
 {
 type symmetryPlane;
 }
 bottom
 {
 type symmetryPlane;
 }
 inlet
 {
//  type freestream;
//  freestreamValue uniform 300;
type fixedValue;
value uniform 300;
 }
 outlet
 {
	 type zeroGradient;
//  type freestream;
//  freestreamValue uniform 300;
 }
 frontAndBack
 {
 type empty;
 }
 cylinder
 {
 type fixedValue;
value uniform 473; }
}
// ************************************************************************* //