system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.4.0 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ddtSchemes
{
default steadyState;
}
gradSchemes
{
default Gauss linear;
}

 divSchemes
 {
 default none;
     div(phi,U)      bounded Gauss limitedLinear 0.2;
div(phi,K)      bounded Gauss limitedLinear 0.2;
    div(phi,h)      bounded Gauss limitedLinear 0.2;
    //div(phi,k)      bounded Gauss limitedLinear 0.2;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
 }

 laplacianSchemes
 {
 default Gauss linear uncorrected;
 }

 interpolationSchemes
 {
 default linear;
 }

 snGradSchemes
 {
 default uncorrected;
 }

 fluxRequired
 {
 default no;
 p_rgh;
 }


 // ************************************************************************* //