system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.4.0 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
p_rgh
{
solver GAMG;
tolerance 1e-7;
relTol 0.01;
smoother DICGaussSeidel;

 cacheAgglomeration true;
 nCellsInCoarsestLevel 100;
 agglomerator faceAreaPair;
 mergeLevels 1;
 maxIter 100;
 }

 "(U|h)"
 {
 solver PBiCG;
 preconditioner DILU;
 tolerance 1e-7;
 relTol 0.01;
 }
 }

 SIMPLE
 {
 momentumPredictor no;
 nNonOrthogonalCorrectors 0;
 pRefCell 0;
 pRefValue 0;
consistent      yes;
  residualControl
  {
      p               1e-2;
      U               1e-3;
      "(k|epsilon|omega|f|v2)" 1e-3;
  }

 }


 relaxationFactors
 {
 rho 1;
 p_rgh 0.7;
 U 0.7;
 h 0.7;
 }